"app.title" = "Todo List";
"nav.home" = "Home";
"nav.analytics" = "Analytics";
"analytics.title" = "Analytics";
"language.title" = "Language";
"language.english" = "English";
"language.chinese" = "Simplified Chinese";
"tab.overview" = "Overview";
"tab.add" = "Add";
"tab.templates" = "Templates";
"tab.tasks" = "Tasks";

"quickadd.placeholder" = "Quick add: tomorrow 9am meeting p1";
"quickadd.button" = "Quick Add";
"quickadd.help" = "Press Enter to add";
"quickadd.focus" = "Focus quick add";
"quickadd.clear" = "Clear";
"quickadd.hint.example" = "Example: tomorrow 9am meeting p1";
"quickadd.floating" = "Quick Add";
"quickadd.hint.missingtitle" = "Enter a title before submitting";
"quickadd.hint.unrecognized" = "No date/priority recognized. Created as a plain title.";
"quickadd.hint.recognized" = "Recognized: %@";
"quickadd.token.separator" = ", ";

"newtodo.placeholder" = "New todo";
"add.button" = "Add";
"newtask.focus" = "Focus new task";
"newtask.moreOptions" = "More options";
"quickfill.title" = "Quick fill";
"quickfill.today" = "Today";
"quickfill.tomorrow" = "Tomorrow";
"quickfill.nextweek" = "Next Week";
"quickview.title" = "Quick Views";
"template.title" = "Default templates";
"template.hint" = "Tap a template to insert a starter checklist.";
"template.manager.title" = "Manage Templates";
"template.manager.empty" = "No templates yet.";
"template.manager.edit" = "Edit";
"template.manager.done" = "Done";
"template.manager.add" = "Add";
"template.manager.name.section" = "Template Name";
"template.manager.name.placeholder" = "Enter a name";
"template.manager.items.section" = "Template Items";
"template.manager.items.empty" = "No items yet.";
"template.manager.item.placeholder" = "Item";
"template.manager.newItem.placeholder" = "New item";
"template.manager.newItem.add" = "Add";
"template.manager.new.title" = "New Template";
"template.manager.edit.title" = "Edit Template";
"template.manager.cancel" = "Cancel";
"template.manager.save" = "Save";
"template.preview.hint" = "Select the items you want to create.";
"template.preview.selectAll" = "Select All";
"template.preview.clear" = "Clear";
"template.preview.cancel" = "Cancel";
"template.preview.create" = "Create";
"template.preview.none" = "No template selected.";
"template.work" = "Work";
"template.life" = "Life";
"template.shopping" = "Shopping list";
"template.work.item1" = "Review priorities";
"template.work.item2" = "Reply to email";
"template.work.item3" = "Update project status";
"template.life.item1" = "Workout for 30 minutes";
"template.life.item2" = "Tidy up the room";
"template.life.item3" = "Read and relax";
"template.shopping.item1" = "Produce";
"template.shopping.item2" = "Household items";
"template.shopping.item3" = "Snacks and drinks";
"priority.label" = "Priority";
"duedate.label" = "Due date";
"filter.label" = "Filter";
"filter.status" = "Status";
"filter.time" = "Time";
"filter.priority" = "Priority";
"sort.label" = "Sort";
"view.title" = "View";
"view.list" = "List";
"view.card" = "Cards";
"sort.manual" = "Manual";
"sort.duedate" = "Due Date";
"sort.priority" = "Priority";
"sort.created" = "Created";
"filter.all" = "All";
"filter.open" = "Open";
"filter.completed" = "Completed";
"filter.today" = "Today";
"filter.anytime" = "Any time";
"filter.thisWeek" = "This Week";
"filter.upcoming" = "Upcoming";
"filter.overdue" = "Overdue";
"filter.tags" = "Tags";
"filter.tags.selected" = "Tags (%d)";
"filter.tags.empty" = "No tags";
"filter.tags.clear" = "Clear tags";
"reorder.notice" = "Reordering is available only in Manual sort with no filters.";
"view.mode" = "View";
"view.today" = "Today";
"view.week" = "This Week";
"view.calendar" = "Calendar";
"view.section.today" = "Today";
"view.section.week" = "This Week";
"calendar.section.noduedate" = "No Due Date";

"empty.search" = "No matching todos";
"empty.none" = "No todos yet";
"empty.view" = "This view is empty";

"section.allTodos" = "All Todos";
"section.open" = "Open";
"section.completed" = "Completed";
"section.dueToday" = "Due Today";
"section.thisWeek" = "This Week";
"section.upcoming" = "Upcoming";
"section.overdue" = "Overdue";

"edit.button" = "Edit";
"delete.button" = "Delete";
"search.focus" = "Focus search";
"search.placeholder" = "Search";
"mark.open" = "Mark Open";
"mark.done" = "Mark Done";
"edit.title" = "Edit Todo";
"edit.field.title" = "Title";
"repeat.label" = "Repeat";
"subtasks.title" = "Subtasks";
"subtasks.add.placeholder" = "Add a subtask";
"subtasks.add.button" = "Add";
"tags.title" = "Tags";
"tags.add.placeholder" = "Add a tag";
"tags.add.button" = "Add";
"edit.cancel" = "Cancel";
"edit.save" = "Save";

"markdown.description" = "Description (Markdown)";
"markdown.preview" = "Preview";
"export.calendar" = "Export to Calendar";
"export.reminder" = "Export to Reminders";
"export.error.title" = "Export Failed";
"export.error.dismiss" = "OK";

"priority.low" = "Low";
"priority.medium" = "Medium";
"priority.high" = "High";
"stats.today.completion.rate" = "Today's completion rate";
"stats.overdue" = "Overdue";
"stats.total" = "Total tasks";
"stats.trend.title" = "7-day completion trend";
"stats.today.completed.count" = "Today completed";
"stats.chart.date" = "Date";
"stats.chart.completed" = "Completed";
"tag.stats.title" = "Tag Summary";
"tag.stats.detail" = "%d/%d completed";

"tag.color.red" = "Red";
"tag.color.orange" = "Orange";
"tag.color.yellow" = "Yellow";
"tag.color.green" = "Green";
"tag.color.teal" = "Teal";
"tag.color.blue" = "Blue";
"tag.color.purple" = "Purple";
"tag.color.pink" = "Pink";
"tag.color.gray" = "Gray";

"notification.body" = "Todo reminder";
